{
    "ratings": {
        "5 star": "35%",
        "4 star": "19%",
        "3 star": "9%",
        "2 star": "16%",
        "1 star": "21%"
    },
    "reviews": [
        {
            "review_comment_count": "",
            "review_text": "I've had some time to kick my phone around (figuratively and literally), and I'm really impressed with this phone. It's value priced, but still very functional. I switched from a Samsung Galaxy SIII, and I feel that this was definitely an upgrade. While the Moto G3 has less memory (8GB) and storage (both internally, and it only supports up to 32GB SDHC micro card), the better processor makes a huge difference. I don't play games, but I do still run a fair number of productivity apps (the biggest being Polaris Office and TeamViewer) and they benefit greatly from the quad-core 1.4 GHz Cortex-A53 CPUs performance. The SIII would always hang up when running bigger applications, and would always freeze up when pulling up the SwiftKey keyboard. Some apps were almost unusable on the SIII because of these stutters and freezing (ProCapture was the biggest problem). I'm really impressed at how good the camera sensor is. The color, contrast, and brightness of the screen are also incredible. I've had better luck with 4G data, though I do notice a little less speed on Wifi after losing 5 gHz connectivity. The audio on the phone is an improvement, with the two larger speakers on the front of the device. Call clarity has been about as good as the SIII, in my tests. The phone construction is very solid, and seems very rugged in general. I was very happy with the upgrade, from the Galaxy SIII. For my purposes, it's a great phone. I like that it's water resistant, and it performs very well. My girlfriend ended up upgrading to the same phone, from an HTC Desire 816, and she's very happy with the performance boost. It's definitely NOT a flagship phone, and it's only suitable for lower-end or older games. This is not a power user phone, by any means. The smaller storage is probably the biggest limitation. While it hasn't greatly affected me, as I only have a few big apps, but it's definitely the most profound limitation of the phone. If you don't need the power and space of a flagship phone, but still want a very high-quality all-weather handset, I think this is an excellent option. The price jumps around, so if you wait around for a small discount, this is probably one of the better deals on the current phone market. It suits my needs very well, and - having survived being caught in a few big downpours - has been worth every penny. Sept. 2016 Update: For a few weeks, I was having problems with the SD Micro card becoming unmounted, or write problems on the SD Micro card. I assumed it was loosening up in the case (a problem I had with an older phone). Eventually it would refuse to re-mount, despite all attempts. It turned out the phone was having specific problems with the Samsung 32GB EVO Plus Class 10 Micro SDHC, that several other Moto G3 users experienced. I replaced it with a Class 6 Kingston card, and it's been working flawlessly ever since, without any noticeable decrease in read/write speeds.",
            "review_posted_date": "01 Aug 2016",
            "review_header": "Excellent Phone For Value-Conscious Buyers & Intermediate Users - Rugged Weatherproof Design",
            "review_rating": "5.0 ",
            "review_author": "Mr. Staack"
        },
        {
            "review_comment_count": "",
            "review_text": "This phone is one of the best I have had from Virgin Mobile, and know it would be better with T-Mobile or another GSM carrier with the extra specs those add. The camera is very nice for such a cheap phone, 13mp in the back, 5mp in the front. Works well in relatively low lighting and doesn't begin to look grainy until it's obviously much too dark, such as outside in the night with a fire for just light like the stone ages. Anyway, it's not the best camera, but definitely better than the LG Volt and LG G Stylo I had had before this one. The screen isn't brilliantly bright and crisp, but I promise it doesn't look horribly. The screen is big, but not too big, more comfortable than the LG G Stylo in my personal opinion, but if you like \"Phablets\", this is a big small, but you'd probably get used to it. The ram is only 1gb in the Virgin Mobile edition, and only 4.5gb of internal storage available to the user, even though it advertises 8gb. The other phone with the GSM carriers have 2gb of ram, and 16gb or storage with only 10gb or so left for the users accessibility. It comes with Lollipop, although I am sure the Marshmellow update wouldn't be long to hit considering it did hit the LG G Stylo quickly, and this phone is the 2015 successor of the Moto G lineups. The phone is able to be rooted, although I do not advise for it will void your warranty with Motorola and possibly Virgin Mobile, so you should know what you are doing. However, this should be brought up because Virgin Mobile carries a variety of cheap phones, but they are mostly LG. LG should not be rooted because they end up killing over and are touchy. Motorola is more laid back, and it should be noted so people know what they should and shouldn't if they are not experienced and want to try new things. Yes, this phone is water resistant, but not water proof. You can not swim with it and epect to use it under water. This is purely for accidents only. You can use this near water and if something splashes on it, it will be fine. You must remember to seal the back near the camera and the edges, or it will completely useless and you will lose your phone to water damage. The biggest con is the bit of crashes I have experienced on such little use. The play store crashes immediately when trying to type, and many other things end up crashing. This may not be a problem to all, but to me it was and should be noted. This does have an LED to those who care about that little helpful feature, however it is not able to be used for anything other than battery purposes, so you don't get anything very helpful from it. There is the feature Moto Display which shows your notifications on the screen in a specific way and there are settings for you to mess with. Over all this phone is a very great phone for the price and something that people can greatly appreciate for a low budget.",
            "review_posted_date": "25 Apr 2016",
            "review_header": "Very good for Virgin Mobile.",
            "review_rating": "5.0 ",
            "review_author": "Veronica Hale"
        },
        {
            "review_comment_count": "",
            "review_text": "This phone is the best virgin mobile phone I have had by far.. I paid only $54.00 for it refurbished on Amazon. Let me start by saying I have tried many. It got to the point where I was so sick of buying hundred plus dollar phones that would crap out by 6 months glitching, memory problems, data problems, etcetera. I've tried all of the LGs they are okay but very hit-and-miss. My last LG experience with a LG Stylo which I thought was going to be a great phone until it would randomly, not receive text messages from important people. I had read about that in many of the reviews on that phone so I took a chance and to my surprise it happened to me too. It may not sound like a huge deal to some but it can really leave you in a predicament. That was the last straw. I have only had this phone a couple of months but so far I have not been disappointed. Aesthetically it's nothing fancy. But the camera is really nice phone, calls are really decent and browsing the web and multiple apps very fast. this is a nice size phone not too big like the stylo not too small at all. This is very colorful compared to any of the LG's I've ever had. Way better then the HTC phones I've owned as well. This phone is an excellent deal and the best Bang for your buck.",
            "review_posted_date": "09 Jul 2016",
            "review_header": "Best budget phone hands down!",
            "review_rating": "5.0 ",
            "review_author": "DM"
        }
    ],
    "url": "http://www.amazon.com/dp/B017HW9DEW",
    "name": "Motorola Moto G (3rd Generation) No Contract Phone (Virgin Mobile) - Retail Packaging",
    "price": ""
}