{
    "ratings": {
        "5 star": "44%",
        "4 star": "21%",
        "3 star": "15%",
        "2 star": "7%",
        "1 star": "13%"
    },
    "reviews": [
        {
            "review_comment_count": "",
            "review_text": "This sweater is very cute. Its a light blue with white and the textile is really soft. Ig goes well with light wash pants and black pants!! I am loving it.",
            "review_posted_date": "05 Dec 2016",
            "review_header": "This sweater is very cute. Its a light blue ...",
            "review_rating": "5.0 ",
            "review_author": "ana"
        },
        {
            "review_comment_count": "",
            "review_text": "This is a cute shirt, but be forewarned. It isn't a full length shirt. The material is thin, more like a t-shirt. I was tempted to send it back, but my daughter liked it. Anyway, the \"one size\" is a small. (This fits my 13-year-old, who is thin.)",
            "review_posted_date": "12 Oct 2016",
            "review_header": "Cute",
            "review_rating": "4.0 ",
            "review_author": "Maria M"
        },
        {
            "review_comment_count": "",
            "review_text": "I've had this sweatshirt for about 6 months now, I still love it and all and its still in great condition. The only problem is that the blue fades over time so right now it looks like white with a hint of light blue.",
            "review_posted_date": "03 Sep 2017",
            "review_header": "I still love it and all and its still in great condition",
            "review_rating": "3.0 ",
            "review_author": "peggy jo gagnon"
        },
        {
            "review_comment_count": "",
            "review_text": "First of all everyones body is different but you coo e to expect certain standards. The tag read 35% cotton, 65@ poly, 5% spandex. This is not a cotton product. Material was thin but soft, colors are not bad. Now I am true Petite L. 146 lb, 5’ tall, in size. 36/38C/D, I wanted a shirt a little oversized. Based on other reviews I sized up to an XL. Mediums are usually just ok if petite is not available. THIS SHIRT WAS WAY SHORT IN THE BODY. And ridiculously long and big in the sleeves. yet slightly snug around the bust due to the drop shoulder cut. I send it back but with my sewing machine at hand I will try to adjust it and just wear it around the house.",
            "review_posted_date": "30 Nov 2017",
            "review_header": "Too Bad! great product but sizing ? ?",
            "review_rating": "1.0 ",
            "review_author": "0"
        },
        {
            "review_comment_count": "",
            "review_text": "As soon as i wash this shirt it turn in three sizes too small. the color faded. I put the sweat shirt in my bag for the poor. I hope a small child will be able to use it since the adult will not be able to use it.",
            "review_posted_date": "26 Jan 2017",
            "review_header": "DON'T WASH",
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_comment_count": "",
            "review_text": "I'm 5\" 6' 155 pounds and usually wear a size large. I bought an extra large and it just fits. It's loose but the length of the hoodie is short. If I put my arms up you can see my undershirt. If I would've ordered my usual size L it would've been too short on me. Also there's less pink color on the front then what I liked but still a great hoodie. Thin but cute look!",
            "review_posted_date": "05 Feb 2018",
            "review_header": "Order a size bigger!!",
            "review_rating": "4.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_comment_count": "",
            "review_text": "My tween daughter got this for her birthday, she loves the ombre coloring of it. I knew it came in Asian sizing so, always size up unless you are really petite. It's light enough for cool weather. The little Union Jack emblem is on a leather-type badge, very cute and classy.",
            "review_posted_date": "17 May 2017",
            "review_header": "It's light enough for cool weather. The little Union Jack emblem is on ...",
            "review_rating": "5.0 ",
            "review_author": "Rebecca"
        },
        {
            "review_comment_count": "",
            "review_text": "I was expecting it to be really thin and low quality but the one I got was surprisingly nice, the hooded part goes farther down than I am used to so I wanted to wear a shirt under it but you can't wear a shirt under it without looking like a goofball because the front goes farther up than the back. There was this weird super itchy tag in it on the side but you can fix that by cutting it off. This pullover is also super crinkly, but don't worry!! Hang it in the bathroom while you are taking your super duper hot shower that doesn't feel that hot to you but it definitely is and boom! No more wrinkles! It also fit a little bit smaller but to be fair, I comfortably wear extra large even though my size is a medium.",
            "review_posted_date": "25 Oct 2017",
            "review_header": "Only doesn't fit cause I'm a goofball and wanted to look cool.",
            "review_rating": "4.0 ",
            "review_author": "Alexandria Lynne"
        }
    ],
    "url": "http://www.amazon.com/dp/B0761GLDYD",
    "name": "SweatyRocks Women's Long Sleeve Hoodie Sweatshirt Colorblock Tie Dye Print Tops",
    "price": "$10.69 - $15.99"
}