{
    "ratings": {
        "5 star": "64%",
        "4 star": "17%",
        "3 star": "5%",
        "2 star": "4%",
        "1 star": "10%"
    },
    "reviews": [
        {
            "review_comment_count": "",
            "review_text": "I love this Samsung J7. I couldn't afford the sticker price for the S6 or S7 (sticker shock!). Therefore; I opted for this which is scaled down in terms of processing/memory BUT it's much better quality than the phone I was using for my Boost Mobile account. I had no issues charging it or switching it over from old phone to this new phone - via my online account (I didn't have to talk to anybody to do this and it worked out just great). My hubby has the Samsung S6 which he saved/paid for upfront (no contract at Boost Mobile). Comparing my new J7 to his S6 - well; apples to oranges. His has 2 processors (a quad-core and an octa-core). This J7 has just the octa-core BUT for me is proving to be plenty of processing power along with the 2GB ROM. This was pretty comparable to the ZTE Warp Elite I've been using since January 2016 but I'd have to say that the Samsung is much faster - also that the screen response is so much better in this J7 model (even with the glass protection I placed on the screen). My hubby bought me this for my upcoming 60th birthday! GREAT present for me.....all mine! Thank you 'shopcelldeals' for selling this at a reasonable price that was affordable. Recommended.",
            "review_posted_date": "06 May 2016",
            "review_header": "GORGEOUS phone .... I'm in love with it!",
            "review_rating": "5.0 ",
            "review_author": "Colleen Marie"
        },
        {
            "review_comment_count": "",
            "review_text": "I love this phone! Coming from the galaxy S3 for Boost this is a big jump in the right direction. $20 cheaper on amazon than the boost mobile site another plus.The battery last all day. That is while talking/texting using apps. It is two times bigger than the S3 but def worth it. The operating system is much faster and more responsive as well.",
            "review_posted_date": "19 Nov 2016",
            "review_header": "Worth it.",
            "review_rating": "5.0 ",
            "review_author": "TG"
        },
        {
            "review_comment_count": "",
            "review_text": "My wife and I updated our phones to the SAMSUNG GALAXY J-7. We enjoyed them SO MUCH, I purchased another set for us as back-up. The picture quality is EXCELLANT. !!!!!",
            "review_posted_date": "07 Mar 2017",
            "review_header": "We enjoyed them SO MUCH",
            "review_rating": "5.0 ",
            "review_author": "K.D.G."
        },
        {
            "review_comment_count": "",
            "review_text": "This phone is SO much better than the Galaxy S3 I had prior. Better memory (by far); Better battery life (by far!!); Better view (bigger screen); If you're looking for an affordable and pretty high-performing smart phone, this could be just what you're looking for. S3 = junk; J7 = superb, really... Two thumbs up for this one, for sure!",
            "review_posted_date": "20 Mar 2017",
            "review_header": "This phone is SO much better than the Galaxy S3 I had prior",
            "review_rating": "5.0 ",
            "review_author": "Boru in Illinois"
        },
        {
            "review_comment_count": "",
            "review_text": "Love...love..love this phone....phone great...battey is great..$50 cheaper than boost mobile website....nice size... I had a Samsung J3 for a month couldnt take it....that phone was slow...camera was horrible....so so glad i made the switch..",
            "review_posted_date": "04 Feb 2017",
            "review_header": "Happy camper!!",
            "review_rating": "5.0 ",
            "review_author": "Fancy Faye"
        },
        {
            "review_comment_count": "",
            "review_text": "I've had this phone for a year and 2 months now. So far so good. I think the camera functions are good, that mattered most to me. And the interface works well, if you are familiar with the Droid. It is a larger size phone which takes some adjustment! Occasionally it overheats but I have a cooling app. Also when the battery gets low to 15%, it goes down to 0 pretty fast. There is bloatware which was expected.. But otherwise I'm happy so far!",
            "review_posted_date": "13 Aug 2018",
            "review_header": "Good phone for price",
            "review_rating": "4.0 ",
            "review_author": "Emily Elizabeth"
        },
        {
            "review_comment_count": "",
            "review_text": "By far one of the best Samsung phones they have made!! I broke mine and searched high and low trying to find a replacement locally but I was unable to find one. I now have an iPhone (which i Love) but if I ever got another Samsung I would definitely try getting this phone again.",
            "review_posted_date": "14 Aug 2018",
            "review_header": "Great phone and Camera for a fair price!",
            "review_rating": "5.0 ",
            "review_author": "Brittany M."
        },
        {
            "review_comment_count": "",
            "review_text": "Great phone. Very comparable to the s6 but processing speeds are a little lower and the internal memory is short. But for the price i will not complain. 4 stars just because I'm a bit disappointed with the cameras. But it has flash on selfie mode, that's cool",
            "review_posted_date": "01 Apr 2017",
            "review_header": "Great phone. Very comparable to the s6 but processing ...",
            "review_rating": "4.0 ",
            "review_author": "RaiderRush"
        }
    ],
    "url": "http://www.amazon.com/dp/B01ETPUQ6E",
    "name": "Samsung Galaxy J7 - No Contract Phone - White - (Boost Mobile)(Carrier locked phone )",
    "price": ""
}